import pandas as p
import numpy as n
f = str(input("введите ФИО ", ))
a = str(input("введите адрес "))
t = str(input("введите номер телефона "))
d = str(input("введите дату рождения "))
fatd = [
    {'ФИО': f, 'адрес': a, 'телефон': t, 'дата рождения': d}
]
af = p.DataFrame(fatd)
print(af)
while True:
    print("1 чтобы добавить запись  ")
    print("2 чтобы удалить запись ")
    print("3 чтобы измменить запись")
    print("4 чтобы закончить редактирование ")
Лабораторная работа №5
Для выполнения данной лабораторной работы Вам необходимо выполнить оба задания, представленные ниже. 
Оба задания должны быть помещены в репозиторий «collections_lz» в GitHUB. Каждое задание выполняется в отдельном файле, должно быть снабжено комментариями, а также иметь дружественный интерфейс (пользователь должен понимать, что вводит, и что получает назад). 
Входные данные могут быть получены как из файла, так и с клавиатуры по усмотрению выполняющего работу. Выходные данные должны иметь такой же вид как и входные: если ввод происходит из файла, то вывод делается в файл, если ввод с клавиатуры, то вывод – в консоль.
Задание 1.
Создайте файл «address_book.py».
Напишите программу на Python, которая реализует с помощью DataFrame адресную книгу с полями: «ФИО», «Адрес», «Телефон», «Дата рождения». 
Реализуйте возможность добавлять, удалять и изменять записи в адресной книге.
Задание 2.
Создайте файл «matrix.py».
Напишите программу на Python, которая создаст матрицу из случайных чисел размером N на M, которые пользователь вводит с клавиатуры. Выведите матрицу в консоль, затем транспонируйте матрицу и снова выведите ее в консоль. Найдите определитель обеих матриц и сравните его. Сравнение также выведите в консоль.
Задание 3.
Создайте файл «graphics.py».
С помощью matplotlib отрисуйте следующие функции:
•	x2
•	ex
•	ln(x)
•	x3
Все функции сделайте разными цветами, точки на функции, соответствующие целым значениям оси Х отметьте различными вариантами: точки, кресты и тд.
