import pandas as p
#создаём пустую таблицу DataFrame с четырьмя столбцами: ФИО, адрес, телефон, дата рождения
af = p.DataFrame(columns=["ФИО", "адрес", "телефон", "дата рождения"])
#бесконечный цикл программа работает пока пользователь не введёт 0
while True:
    #выводим меню доступных операций
    print("\n1 - добавить запись\n2 - удалить запись\n3 - измменить запись\n4 - посмотреть книгу\n0 - закончить редактирование ")
    x = int(input("выберите операцию ")) #переменнная для выбора операции
    #считываем номер выбранной операции
    if x == 1:
        #запрашиваем у пользователя данные для новой записи
        f = input("введите ФИО ")
        a = input("введите адрес ")
        t = input("введите номер телефона ")
        d = input("введите дату рождения (ДД.ММ.ГГГГ) ")
        if af.empty: #если таблица пустая новый id = 0
            id = 0
        else: #если таблица не пуста создает новый id
            id = af.index.max()+1
        af.loc[id] = [f, a, t, d]  #добавляем строку с новыми данными по индексу id
    elif x == 2:
        if af.empty: #проверяем пустая ли таблица
            print("в книге нет записей")
        else:
            id_d = int(input("введите id записи для удаления ")) #index to delete переменная которая задает значения индекса для удаления
            if id_d in af.index: #проверяем есть ли этот индерс в таблице
                af = af.drop(index = id_d) #удаляет строку по введенному числу
            else:
                print("нет такого id") #сообщение если таблица пустая
    elif x == 3:
        if af.empty: #проверяем пустая ли таблица
            print("в книге нет записей")
        else:
            id_c = int(input("введите id записи для изменения "))#index to change переменная которая задает значение индекса для замены строки
            if id_c in af.index: #проверяем есть ли этот индерс в таблице
                #ввод новых данных для строки
                f = input("введите новый ФИО ")
                a = input("введите новый адрес ")
                t = input("введите новый номер телефона ")
                d = input("введите новую дату рождения (ДД.ММ.ГГГГ) ")
                af.loc[id_c, ["ФИО", "адрес", "телефон", "дата рождения"]] = [f, a, t, d] #изменяем строку с новыми данными по индексу id
    elif x == 4:
        print(af) #выводит таблицу
    elif x == 0:
        break #заканчивает цикл и программу
    else:
        print("нет такого пункта, введи 0-4") #если ввести цифру которой нет в меню