import random
import pandas as pd
import numpy as np
#ввод размеров матрицы: n — количество строк, m — количество столбцов
n = int(input("введите количество столбцов N "))
m = int(input("введите количество столбцов M "))
#создаём матрицу размера n на m со случайными целыми числами от 1 до 100 включительно
mat = np.random.randint(1, 101, size=(n, m))
print(mat) #выводим исходную матрицу
tam = mat.T #транспонируем матрицу
print("транспортированная матрица")
print(tam) #выводим транспонированную матрицу
if n == m: #определитель существует только у квадратной матрицы (n == m)
    det1 = np.linalg.det(mat) #вычисляем определитель исходной матрицы
    print("детерминант 1 матрицы det1=", det1)
    det2 = np.linalg.det(tam) #вычисляем определитель транспонированной матрицы
    print("детерминант 2 матрицы det2=", det2)
    #сравниваем определители и выводим результат сравнения
    if det1>det2: 
        print("det1>det2")
    elif det1<det2:
        print("det1<det2")
    elif det1==det2:
        print("det1=det2")
else: 
    #ошибка если матрица неквадратная
    print("детерминант нельзя найти у неквадратной матрицы")